clusterMHDTest/Cilindro/M6/HLLC/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 6.06218;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 6.06218;
    }
    cilindro
    {
        type            calculated;
        value           nonuniform List<scalar> 
119
(
0.04001
0.120023
0.200015
0.279972
0.359881
0.439727
0.519496
0.599174
...
)
;
    }
    front_back
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 6.06218;
    }
    simetria
    {
        type            calculated;
        value           uniform 6.06218;
    }
}


// ************************************************************************* //
