clusterMHDTest/Cilindro/M6/HLLC/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.5 0 0);

boundaryField
{
    front_back      
    {
                type            empty;
      		
    }

    simetria      
    {
        type slip;
    }




    Inlet      
	{
		

               type          fixedValue;
		
		value uniform (3.5 0 0);

		

	} 


		
    outlet          
    {
                type           zeroGradient;
    }


  cilindro
        {
                type           slip;

        }
}

// ************************************************************************* //
